In [1]:
import pandas as pd
import os

In [2]:
file = '/Users/nataliebernal/Desktop/git/Data_Analytics_Final_Project/book_crossing_files/original_csv/BX-users.csv'        

# Determine what the character encoding is
# import chardet
# with open(file, 'rb') as rawdata:
#     result = chardet.detect(rawdata.read(100000))
# result

# Insert sep to seperate data, character encoding, and skip bad lines
books = pd.read_csv(file, sep=";",encoding='ISO-8859-1', on_bad_lines='skip')

In [3]:
# Display DataFrame
books.head()

   User-ID                            Location   Age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN

In [4]:
books.describe()

            User-ID            Age
count  278858.00000  168096.000000
mean   139429.50000      34.751434
std     80499.51502      14.428097
min         1.00000       0.000000
25%     69715.25000      24.000000
50%    139429.50000      32.000000
75%    209143.75000      44.000000
max    278858.00000     244.000000

In [5]:
# Check for duplicates
print(f"Duplicate entries: {books.duplicated().sum()}")

Duplicate entries: 0

In [6]:
for column in books.columns:
    print(f"Column {column} has {books[column].isnull().sum()} null values")

Column User-ID has 0 null values
Column Location has 0 null values
Column Age has 110762 null values

In [7]:
userid_clean = books.dropna()

In [8]:
for column in userid_clean.columns:
    print(f"Column {column} has {userid_clean[column].isnull().sum()} null values")

Column User-ID has 0 null values
Column Location has 0 null values
Column Age has 0 null values

In [9]:
# Print the total number of tradable cryptocurrencies.
print(f"There are {userid_clean['User-ID'].unique().size} users")

There are 168096 users

In [16]:
userid_clean = userid_clean.rename(columns={"User-ID": "user_id", "Location": "address", "Age": "age"})

userid_clean

        user_id                             address   age
1             2           stockton, california, usa  18.0
3             4           porto, v.n.gaia, portugal  17.0
5             6       santa monica, california, usa  61.0
9            10          albacete, wisconsin, spain  26.0
10           11      melbourne, victoria, australia  14.0
...         ...                                 ...   ...
278848   278849         georgetown, ontario, canada  23.0
278850   278851                  dallas, texas, usa  33.0
278851   278852     brisbane, queensland, australia  32.0
278852   278853      stranraer, n/a, united kingdom  17.0
278854   278855  tacoma, washington, united kingdom  50.0

[168096 rows x 3 columns]

In [21]:
# Changing data type for SQL purposes
userid_clean.age = userid_clean.age.astype(int)

In [22]:
userid_clean.dtypes

user_id     int64
address    object
age         int64
dtype: object

In [23]:
# Set the output file name
output_data_file = "/Users/nataliebernal/Desktop/git/Data_Analytics_Final_Project/book_crossing_files/csv/users.csv"
# Export the city_data DataFrame into a CSV file
userid_clean.to_csv(output_data_file, index=False)